LTVA1/STM32CrapSynth/STM32CrapSynthFirmware/src/playback.c
/*
 * playback.c
 *
 *  Created on: 9 ���. 2024 �.
 *      Author: georg
 */

#include "playback.h"
#include "stm32f3xx.h"
#include "main.h"
#include "commands.h"
#include "external_flash.h"
#include "gpio.h"
#include "pga2320.h"
#include "ad9833.h"

#include <string.h>

uint8_t wavetable_array[3][WAVETABLE_SIZE];

uint16_t curr_buf_pos;
uint16_t curr_read_buf_pos;
uint32_t curr_dump_pos;
uint8_t new_tick;

uint8_t chan_base_addr[20];

uint8_t curr_command;
uint8_t curr_chan;

uint32_t dummy;

extern Program_state_ccm state_ccm;
extern Program_state_ram state_ram;
extern uint8_t spi_rx_double_buf[];

extern uint8_t att_need_write;

TIM_TypeDef* pwm_timers[4] = { TIM3, TIM4, TIM8, TIM15 };
TIM_TypeDef* noise_clock_timer = TIM17;

USART_TypeDef* phase_reset_uarts[4] = { USART1, USART2, USART3, UART5 };
IRQn_Type phase_reset_interrupts[6] = { TIM20_UP_IRQn, 0, /*SysTick*/ USART1_IRQn, USART2_IRQn, USART3_IRQn, UART5_IRQn };

DMA_Channel_TypeDef* samp_chans_dma[3] = { DMA2_Channel3, DMA2_Channel4, DMA1_Channel6 };
DMA_Channel_TypeDef* wave_copy_chans_dma[3] = { DMA2_Channel1, DMA1_Channel7, DMA1_Channel1 };
TIM_TypeDef* samp_chans_timers[3] = { TIM6, TIM7, TIM16 };
IRQn_Type samp_chans_IRQ[3] = { DMA2_Channel3_IRQn, DMA2_Channel4_IRQn, DMA1_Channel6_IRQn };

__attribute__((section (".ccmram")))
void DMA2_Channel3_IRQHandler()
{
	DMA2->IFCR |= DMA_IFCR_CTCIF3;
	DMA2_Channel3->CCR &= ~DMA_CCR_EN; //stop DMA
	TIM6->CR1 &= ~TIM_CR1_CEN;

	Sample_state* ss = &state_ram.dac[0];

	ss->curr_pos += ss->curr_portion_size;

	if(ss->curr_pos < ss->length)
	{
		DMA2_Channel3->CMAR = (ss->in_ram ? (uint32_t)&sample_mem_ram[0] : BASE_ADDR_FLASH) + ss->start_offset + ss->curr_pos;
		DMA2_Channel3->CNDTR = my_min(0xffff, ss->length - ss->curr_pos);
		ss->curr_portion_size = my_min(0xffff, ss->length - ss->curr_pos);

		DMA2_Channel3->CCR |= DMA_CCR_EN;
		TIM6->CR1 = TIM_CR1_CEN;

		return;
	}

	if(ss->curr_pos == ss->length && ss->loop)
	{
		ss->curr_pos = ss->loop_point;
		DMA2_Channel3->CMAR = (ss->in_ram ? (uint32_t)&sample_mem_ram[0] : BASE_ADDR_FLASH) + ss->start_offset + ss->loop_point;
		DMA2_Channel3->CNDTR = my_min(0xffff, ss->length - ss->curr_pos);
		ss->curr_portion_size = my_min(0xffff, ss->length - ss->curr_pos);

		DMA2_Channel3->CCR |= DMA_CCR_EN;
		TIM6->CR1 = TIM_CR1_CEN;

		return;
	}
}

__attribute__((section (".ccmram")))
void DMA2_Channel4_IRQHandler()
{
	DMA2->IFCR |= DMA_IFCR_CTCIF4;
	DMA2_Channel4->CCR &= ~DMA_CCR_EN; //stop DMA
	TIM7->CR1 &= ~TIM_CR1_CEN;

	Sample_state* ss = &state_ram.dac[1];

	ss->curr_pos += ss->curr_portion_size;

	if(ss->curr_pos < ss->length)
	{
		DMA2_Channel4->CMAR = (ss->in_ram ? (uint32_t)&sample_mem_ram[0] : BASE_ADDR_FLASH) + ss->start_offset + ss->curr_pos;
		DMA2_Channel4->CNDTR = my_min(0xffff, ss->length - ss->curr_pos);
		ss->curr_portion_size = my_min(0xffff, ss->length - ss->curr_pos);

		DMA2_Channel4->CCR |= DMA_CCR_EN;
		TIM7->CR1 = TIM_CR1_CEN;

		return;
	}

	if(ss->curr_pos == ss->length && ss->loop)
	{
		ss->curr_pos = ss->loop_point;
		DMA2_Channel4->CMAR = (ss->in_ram ? (uint32_t)&sample_mem_ram[0] : BASE_ADDR_FLASH) + ss->start_offset + ss->loop_point;
		DMA2_Channel4->CNDTR = my_min(0xffff, ss->length - ss->curr_pos);
		ss->curr_portion_size = my_min(0xffff, ss->length - ss->curr_pos);

		DMA2_Channel4->CCR |= DMA_CCR_EN;
		TIM7->CR1 = TIM_CR1_CEN;

		return;
	}
}

__attribute__((section (".ccmram")))
void DMA1_Channel6_IRQHandler()
{
	DMA1->IFCR |= DMA_IFCR_CTCIF6;
	DMA1_Channel6->CCR &= ~DMA_CCR_EN; //stop DMA
	TIM16->CR1 &= ~TIM_CR1_CEN;

	Sample_state* ss = &state_ram.dac[2];

	ss->curr_pos += ss->curr_portion_size;

	if(ss->curr_pos < ss->length)
	{
		DMA1_Channel6->CMAR = (ss->in_ram ? (uint32_t)&sample_mem_ram[0] : BASE_ADDR_FLASH) + ss->start_offset + ss->curr_pos;
		DMA1_Channel6->CNDTR = my_min(0xffff, ss->length - ss->curr_pos);
		ss->curr_portion_size = my_min(0xffff, ss->length - ss->curr_pos);

		DMA1_Channel6->CCR |= DMA_CCR_EN;
		TIM16->CR1 = TIM_CR1_CEN;

		return;
	}

	if(ss->curr_pos == ss->length && ss->loop)
	{
		ss->curr_pos = ss->loop_point;
		DMA1_Channel6->CMAR = (ss->in_ram ? (uint32_t)&sample_mem_ram[0] : BASE_ADDR_FLASH) + ss->start_offset + ss->loop_point;
		DMA1_Channel6->CNDTR = my_min(0xffff, ss->length - ss->curr_pos);
		ss->curr_portion_size = my_min(0xffff, ss->length - ss->curr_pos);

		DMA1_Channel6->CCR |= DMA_CCR_EN;
		TIM16->CR1 = TIM_CR1_CEN;

		return;
	}
}

__attribute__((section (".ccmram")))
void TIM2_IRQHandler()
{
	if(TIM2->SR & TIM_SR_UIF)
	{
		TIM2->SR &= ~TIM_SR_UIF;
		new_tick = 1;
	}
}

__attribute__((section (".ccmram")))
void load_noise_lfsr()
{
	Noise_state* noise = &state_ram.noise;

	//switch clock to GPIO mode
	GPIOB->MODER &= ~GPIO_MODER_MODER7;
	GPIOB->MODER |= GPIO_MODER_MODER7_0; //GPIO output

	if(noise->clock_source == 0)
	{
		NOISE_CLOCK_EXTERNAL
	}

	SCK_NOISE_HIGH

	CS_NOISE_LOW

	for(int i = 0; i < 23; i++)
	{
		if(noise->lfsr & (1 << i))
		{
			DATA_NOISE_HIGH
			SCK_NOISE_LOW
		}
		else
		{
			DATA_NOISE_LOW
			SCK_NOISE_LOW
		}

		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");

		SCK_NOISE_HIGH

		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
		asm("nop");
	}

	CS_NOISE_HIGH
	DATA_NOISE_LOW

	if(noise->clock_source == 0)
	{
		NOISE_CLOCK_INTERNAL
	}

	GPIOB->MODER &= ~GPIO_MODER_MODER7;
	GPIOB->MODER |= GPIO_MODER_MODER7_1; //altfunc output (clock from timer)
}

__attribute__((section (".ccmram")))
void phase_reset(uint8_t channel)
{
	switch(channel)
	{
		case 0:
		case 1:
		case 2:
		case 3:
		{
			ad9833_reset(channel);
			break;
		}
		case 4:
		{
			load_noise_lfsr();
			break;
		}
		case 5:
		case 6:
		case 7:
		{
			Sample_state* ss = &state_ram.dac[channel - 5];

			if(ss->wavetable)
			{
				samp_chans_timers[channel - 5]->CR1 &= ~TIM_CR1_CEN;
				samp_chans_dma[channel - 5]->CCR &= ~DMA_CCR_EN;

				NVIC_DisableIRQ(samp_chans_IRQ[channel - 5]);

				samp_chans_dma[channel - 5]->CMAR = (uint32_t)&wavetable_array[channel - 5][0];
				samp_chans_dma[channel - 5]->CNDTR = WAVETABLE_SIZE;
				samp_chans_dma[channel - 5]->CCR |= DMA_CCR_CIRC;

				samp_chans_dma[channel - 5]->CCR |= DMA_CCR_EN;

