LTVA1/STM32CrapSynth/STM32CrapSynthFirmware/src/playback.c
				samp_chans_timers[channel - 5]->CR1 |= TIM_CR1_CEN;
			}
			else
			{
				if(channel < 7)
				{
					uint32_t copy = DAC->CR;
					DAC->CR &= ((channel - 5) ? (~DAC_CR_WAVE2) : (~DAC_CR_WAVE1)); //reset wave gen
					DAC->CR |= copy & ((channel - 5) ? (~DAC_CR_WAVE2) : (~DAC_CR_WAVE1));
				}

				samp_chans_timers[channel - 5]->CR1 &= ~TIM_CR1_CEN;
				samp_chans_dma[channel - 5]->CCR &= ~(DMA_CCR_EN);
				samp_chans_dma[channel - 5]->CCR &= ~(DMA_CCR_CIRC);
				ss->curr_pos = 0;
				samp_chans_dma[channel - 5]->CMAR = (ss->in_ram ? (uint32_t)&sample_mem_ram[0] : BASE_ADDR_FLASH) + ss->start_offset;
				samp_chans_dma[channel - 5]->CNDTR = my_min(0xffff, ss->length);

				ss->curr_portion_size = my_min(0xffff, ss->length);
				//ss->loop = (command == CMD_DAC_PLAY_SAMPLE_LOOPED ? 1 : 0);

				NVIC_EnableIRQ(samp_chans_IRQ[channel - 5]);

				samp_chans_dma[channel - 5]->CCR |= DMA_CCR_TCIE;

				samp_chans_dma[channel - 5]->CCR |= DMA_CCR_EN;
				samp_chans_timers[channel - 5]->CR1 |= TIM_CR1_CEN;
			}
			break;
		}
		default: break;
	}
}

//phase reset timer 1
__attribute__((section (".ccmram")))
void TIM20_UP_IRQHandler()
{
	//CS_NOISE_HIGH
	if(TIM20->SR & TIM_SR_UIF)
	{
		TIM20->SR = ~(TIM_SR_UIF); //clear interrupt

		for(uint8_t i = 0; i < 8; i++)
		{
			if(state_ram.timer[0].chan_bitmask & (1 << i))
			{
				phase_reset(i);
			}
		}
	}
	//CS_NOISE_LOW
}

//phase reset timer 2
__attribute__((section (".ccmram")))
void SysTick_Handler()
{
	//ZCEN_1_ENABLE
	for(uint8_t i = 0; i < 8; i++)
	{
		if(state_ram.timer[1].chan_bitmask & (1 << i))
		{
			phase_reset(i);
		}
	}
	//ZCEN_1_DISABLE
}

//phase reset timer 3
__attribute__((section (".ccmram")))
void USART1_IRQHandler()
{
	//ZCEN_2_ENABLE
	if (USART1->ISR & USART_ISR_TXE)
	{
		USART1->TDR = 0; //clear interrupt

		for(uint8_t i = 0; i < 8; i++)
		{
			if(state_ram.timer[2].chan_bitmask & (1 << i))
			{
				phase_reset(i);
			}
		}
	}
	//ZCEN_2_DISABLE
}

//phase reset timer 4
__attribute__((section (".ccmram")))
void USART2_IRQHandler()
{
	//ZCEN_3_ENABLE
	if (USART2->ISR & USART_ISR_TXE)
	{
		USART2->TDR = 0; //clear interrupt

		for(uint8_t i = 0; i < 8; i++)
		{
			if(state_ram.timer[3].chan_bitmask & (1 << i))
			{
				phase_reset(i);
			}
		}
	}
	//ZCEN_3_DISABLE
}

//phase reset timer 5
__attribute__((section (".ccmram")))
void USART3_IRQHandler()
{
	//ZCEN_DAC_ENABLE
	if (USART3->ISR & USART_ISR_TXE)
	{
		USART3->TDR = 0; //clear interrupt

		for(uint8_t i = 0; i < 8; i++)
		{
			if(state_ram.timer[4].chan_bitmask & (1 << i))
			{
				phase_reset(i);
			}
		}
	}
	//ZCEN_DAC_DISABLE
}

//phase reset timer 6
__attribute__((section (".ccmram")))
void UART5_IRQHandler()
{
	//NOISE_CLOCK_EXTERNAL
	if (UART5->ISR & USART_ISR_TXE)
	{
		UART5->TDR = 0; //clear interrupt

		for(uint8_t i = 0; i < 8; i++)
		{
			if(state_ram.timer[5].chan_bitmask & (1 << i))
			{
				phase_reset(i);
			}
		}
	}
	//NOISE_CLOCK_INTERNAL
}

__attribute__((section (".ccmram")))
void read_reg_dump(uint8_t half, uint8_t start)
{
	external_flash_read_data(curr_dump_pos, &spi_rx_double_buf[half ? (EXT_FLASH_RX_BUF_SIZE / 2) : 0], (EXT_FLASH_RX_BUF_SIZE / 2), start);

	curr_dump_pos += EXT_FLASH_RX_BUF_SIZE / 2;
	curr_buf_pos += EXT_FLASH_RX_BUF_SIZE / 2;

	if(curr_buf_pos == EXT_FLASH_RX_BUF_SIZE)
	{
		curr_buf_pos = 0;
	}
}

__attribute__((section (".ccmram")))
uint8_t reg_dump_read_byte()
{
	if(curr_read_buf_pos >= EXT_FLASH_RX_BUF_SIZE)
	{
		read_reg_dump(1, 0);
		curr_read_buf_pos = 0;
	}

	if(curr_read_buf_pos == EXT_FLASH_RX_BUF_SIZE / 2)
	{
		read_reg_dump(0, 0);
	}

	uint8_t data = spi_rx_double_buf[curr_read_buf_pos];
	curr_read_buf_pos++;

	return data;
}

__attribute__((section (".ccmram")))
uint16_t reg_dump_read_two_bytes()
{
	return ((uint16_t)reg_dump_read_byte() | ((uint16_t)reg_dump_read_byte() << 8));
}

__attribute__((section (".ccmram")))
uint32_t reg_dump_read_three_bytes()
{
	return ((uint32_t)reg_dump_read_byte() | ((uint32_t)reg_dump_read_byte() << 8) | ((uint32_t)reg_dump_read_byte() << 16));
}

__attribute__((section (".ccmram")))
uint32_t reg_dump_read_four_bytes()
{
	return ((uint32_t)reg_dump_read_byte() | ((uint32_t)reg_dump_read_byte() << 8) | ((uint32_t)reg_dump_read_byte() << 16) | ((uint32_t)reg_dump_read_byte() << 24));
}

__attribute__((section (".ccmram")))
void pwm_set_duty(uint8_t chan, uint16_t duty)
{
	PSG_state* psg = &state_ram.psg[chan];
	psg->duty = duty;

	switch(chan)
	{
		case 0:
		{
			TIM3->CCR3 = duty * TIM3->ARR / 0xffff;
			break;
		}
		case 1:
		{
			TIM4->CCR1 = duty * TIM4->ARR / 0xffff;
			break;
		}
		case 2:
		{
			TIM8->CCR3 = duty * TIM8->ARR / 0xffff;
			break;
		}
		case 3:
		{
			TIM15->CCR1 = duty * TIM15->ARR / 0xffff;
			break;
		}
		default: break;
	}
}

void playback_init()
{
	curr_buf_pos = 0;
	curr_dump_pos = 0;
	new_tick = 0;
	curr_read_buf_pos = 0;

	memset(&state_ram, 0, sizeof(Program_state_ram));

	for(int i = 0; i < 5; i++) //AD9833 chans & noise chan
	{
		chan_base_addr[i] = 8 * i;
	}
	for(int i = 5; i < 8; i++) //DAC chans
	{
		chan_base_addr[i] = 8 * 5 + 32 * (i - 5);
	}
	for(int i = 8; i < 14; i++) //phase reset timer chans
	{
		chan_base_addr[i] = 8 * 5 + 32 * 3 + 8 * (i - 8);
	}

	chan_base_addr[14] = 0xff;
}

__attribute__((section (".ccmram")))
void set_playback_rate()
{
	TIM2->CR1 &= ~TIM_CR1_CEN;
	TIM2->CNT = 0;

	TIM2->ARR = reg_dump_read_four_bytes();
	TIM2->PSC = 0;

	TIM2->CR1 |= TIM_CR1_CEN;
}

void start_playback()
{
	TIM2->CR1 &= ~TIM_CR1_CEN;
	TIM2->CNT = 0;

	playback_init();

	read_reg_dump(0, 1);
	read_reg_dump(1, 0);

	TIM2->ARR = reg_dump_read_four_bytes();
	TIM2->PSC = 0;

	for(int i = 0; i < 4; i++)
	{
		pwm_set_duty(i, 0);
		ad9833_write_freq(i, 0);
		ad9833_reset(i);
		connect_dds(i);
	}

	NOISE_CLOCK_EXTERNAL

	TIM20->CR1 &= ~TIM_CR1_CEN;
	SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;

	for(int i = 0; i < 4; i++)
	{
		NVIC_DisableIRQ(phase_reset_interrupts[i + 2]);
		phase_reset_uarts[i]->CR1 &= ~(USART_CR1_TE | USART_CR1_UE);
	}

	NVIC_EnableIRQ(TIM2_IRQn);
	TIM2->CR1 |= TIM_CR1_CEN;
}

void stop_playback()
{
	NVIC_DisableIRQ(TIM2_IRQn);

	TIM2->CR1 &= ~TIM_CR1_CEN;

	for(int i = 0; i < 3; i++)
	{
		samp_chans_dma[i]->CCR &= ~DMA_CCR_EN;
		wave_copy_chans_dma[i]->CCR &= ~DMA_CCR_EN;
		samp_chans_timers[i]->CR1 &= ~TIM_CR1_CEN;
		NVIC_DisableIRQ(samp_chans_IRQ[i]);
	}

