LTVA1/STM32CrapSynth/STM32CrapSynthFirmware/src/playback.c
	for(int i = 0; i < 4; i++)
	{
		pwm_set_duty(i, 0);
		ad9833_write_freq(i, 0);
		ad9833_reset(i);
		connect_dds(i);
	}

	TIM20->CR1 &= ~TIM_CR1_CEN;
	SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;

	for(int i = 0; i < 4; i++)
	{
		NVIC_DisableIRQ(phase_reset_interrupts[i + 2]);
		phase_reset_uarts[i]->CR1 &= ~(USART_CR1_TE | USART_CR1_UE);
	}

	TIM1->CCR1 = 0;

	CS_EXT_FLASH_HIGH
}

__attribute__((section (".ccmram")))
void execute_dds_pwm_command(uint8_t chan, uint8_t command)
{
	PSG_state* psg = &state_ram.psg[chan];

	switch(command)
	{
		case CMD_AD9833_VOL:
		{
			psg->volume = reg_dump_read_byte();
			att_write_vol(chan, psg->volume);
			//att_need_write = 1;
			break;
		}
		case CMD_AD9833_WAVE_TYPE:
		{
			psg->wave = reg_dump_read_byte();

			if(psg->wave == 5)
			{
				connect_pwm(chan);
			}
			if(psg->wave < 5 && psg->wave > 0)
			{
				ad9833_change_wave(chan, psg->wave - 1);
				connect_dds(chan);
			}
			if(psg->wave == 0)
			{
				ad9833_write_freq(chan, 0);
				ad9833_reset(chan);
				connect_dds(chan);
			}
			break;
		}
		case CMD_AD9833_FREQ:
		{
			ad9833_write_freq(chan, reg_dump_read_four_bytes());
			break;
		}
		case CMD_AD9833_PHASE_RESET:
		{
			if(psg->wave == 5)
			{
				pwm_timers[chan]->CNT = 0;
			}
			if(psg->wave < 5 && psg->wave > 0)
			{
				ad9833_reset(chan);
			}
			break;
		}
		case CMD_AD9833_PWM_FREQ:
		{
			pwm_timers[chan]->CR1 &= ~TIM_CR1_CEN;

			pwm_timers[chan]->PSC = reg_dump_read_byte();
			pwm_timers[chan]->ARR = reg_dump_read_two_bytes();

			if(pwm_timers[chan]->CNT >= pwm_timers[chan]->ARR)
			{
				pwm_timers[chan]->CNT = pwm_timers[chan]->ARR - 3;
			}

			pwm_timers[chan]->CR1 |= TIM_CR1_CEN;

			pwm_set_duty(chan, psg->duty);
			break;
		}
		case CMD_AD9833_PWM_DUTY:
		{
			pwm_set_duty(chan, reg_dump_read_two_bytes());
			break;
		}
		case CMD_AD9833_ZERO_CROSS_ENABLE:
		{
			switch(chan)
			{
				case 0:
				case 1:
				{
					ZCEN_1_ENABLE
					break;
				}
				case 2:
				case 3:
				{
					ZCEN_2_ENABLE
					break;
				}
				default: break;
			}
			break;
		}
		case CMD_AD9833_ZERO_CROSS_DISABLE:
		{
			switch(chan)
			{
				case 0:
				case 1:
				{
					ZCEN_1_DISABLE
					break;
				}
				case 2:
				case 3:
				{
					ZCEN_2_DISABLE
					break;
				}
				default: break;
			}
			break;
		}
		default: break;
	}
}

__attribute__((section (".ccmram")))
void execute_noise_command(uint8_t command)
{
	Noise_state* noise = &state_ram.noise;

	switch(command)
	{
		case CMD_NOISE_VOL:
		{
			noise->volume = reg_dump_read_byte();
			att_write_vol(4, noise->volume);
			//att_need_write = 1;
			break;
		}
		case CMD_NOISE_CLOCK_INTERNAL:
		{
			NOISE_CLOCK_INTERNAL
			noise->clock_source = 0;
			break;
		}
		case CMD_NOISE_CLOCK_EXTERNAL:
		{
			NOISE_CLOCK_EXTERNAL
			noise->clock_source = 1;
			break;
		}
		case CMD_NOISE_ZERO_CROSS_ENABLE:
		{
			ZCEN_3_ENABLE
			break;
		}
		case CMD_NOISE_ZERO_CROSS_DISABLE:
		{
			ZCEN_3_DISABLE
			break;
		}
		case CMD_NOISE_FREQ:
		{
			noise_clock_timer->CR1 &= ~TIM_CR1_CEN;

			noise_clock_timer->PSC = reg_dump_read_byte();
			noise_clock_timer->ARR = reg_dump_read_two_bytes();

			if(noise_clock_timer->CNT >= noise_clock_timer->ARR)
			{
				noise_clock_timer->CNT = noise_clock_timer->ARR - 3;
			}

			noise_clock_timer->CCR1 = noise_clock_timer->ARR >> 1; //50% duty cycle clock

			noise_clock_timer->CR1 |= TIM_CR1_CEN;
			break;
		}

		case CMD_NOISE_RESET:
		case CMD_NOISE_LOAD_LFSR:
		{
			if(command == CMD_NOISE_LOAD_LFSR)
			{
				noise->lfsr = reg_dump_read_three_bytes();
			}

			load_noise_lfsr();
			break;
		}

		default: break;
	}
}

__attribute__((section (".ccmram")))
void execute_dac_command(uint8_t chan, uint8_t command)
{
	Sample_state* ss = &state_ram.dac[chan];

	switch(command)
	{
		case CMD_DAC_VOLUME:
		{
			ss->volume = reg_dump_read_byte();

			if(chan < 2)
			{
				att_write_vol(5 + chan, ss->volume);
				//att_need_write = 1;
			}
			if(chan == 2)
			{
				TIM1->ARR = 1023 - ss->volume * 3;
			}

			break;
		}
		case CMD_DAC_PLAY_SAMPLE:
		case CMD_DAC_PLAY_SAMPLE_LOOPED:
		{
			samp_chans_timers[chan]->CR1 &= ~TIM_CR1_CEN;
			samp_chans_dma[chan]->CCR &= ~(DMA_CCR_EN);
			samp_chans_dma[chan]->CCR &= ~(DMA_CCR_CIRC);
			ss->curr_pos = 0;
			ss->wavetable = 0;
			samp_chans_dma[chan]->CMAR = (ss->in_ram ? (uint32_t)&sample_mem_ram[0] : BASE_ADDR_FLASH) + ss->start_offset;
			samp_chans_dma[chan]->CNDTR = my_min(0xffff, ss->length);

			ss->curr_portion_size = my_min(0xffff, ss->length);
			ss->loop = (command == CMD_DAC_PLAY_SAMPLE_LOOPED ? 1 : 0);

			NVIC_EnableIRQ(samp_chans_IRQ[chan]);

			samp_chans_dma[chan]->CCR |= DMA_CCR_TCIE;

			samp_chans_dma[chan]->CCR |= DMA_CCR_EN;
			samp_chans_timers[chan]->CR1 |= TIM_CR1_CEN;
			break;
		}
		case CMD_DAC_PLAY_WAVETABLE:
		{
			samp_chans_timers[chan]->CR1 &= ~TIM_CR1_CEN;
			samp_chans_dma[chan]->CCR &= ~DMA_CCR_EN;
			ss->wavetable = 1;

			NVIC_DisableIRQ(samp_chans_IRQ[chan]);

			samp_chans_dma[chan]->CMAR = (uint32_t)&wavetable_array[chan][0];
			samp_chans_dma[chan]->CNDTR = WAVETABLE_SIZE;
			samp_chans_dma[chan]->CCR |= DMA_CCR_CIRC;

			samp_chans_dma[chan]->CCR |= DMA_CCR_EN;

			samp_chans_timers[chan]->CR1 |= TIM_CR1_CEN;
			break;
		}
		case CMD_DAC_STOP:
		{
			samp_chans_timers[chan]->CR1 &= ~TIM_CR1_CEN;
			samp_chans_dma[chan]->CCR &= ~DMA_CCR_EN;
			break;
		}
		case CMD_DAC_START_ADDR_FLASH:
		{
			ss->in_ram = 0;
			ss->start_offset = reg_dump_read_three_bytes();
			break;
		}
		case CMD_DAC_START_ADDR_RAM:
		{
			ss->in_ram = 1;
			ss->start_offset = reg_dump_read_two_bytes();
			break;
		}
		case CMD_DAC_RESET:
		{
			samp_chans_timers[chan]->CR1 &= ~TIM_CR1_CEN;
			samp_chans_dma[chan]->CCR &= ~DMA_CCR_EN;

			ss->curr_pos = 0;

			samp_chans_dma[chan]->CNDTR = (ss->wavetable ? WAVETABLE_SIZE : my_min(0xffff, ss->length));
			ss->curr_portion_size = my_min(0xffff, ss->length);

			if(chan < 2)
			{
				uint32_t copy = DAC->CR;
				DAC->CR &= (chan ? (~DAC_CR_WAVE2) : (~DAC_CR_WAVE1)); //reset wave gen
				DAC->CR |= copy & (chan ? (~DAC_CR_WAVE2) : (~DAC_CR_WAVE1));
			}

			samp_chans_dma[chan]->CCR |= DMA_CCR_EN;
			samp_chans_timers[chan]->CR1 |= TIM_CR1_CEN;
			break;
		}
		case CMD_DAC_TIMER_FREQ:
		{
			samp_chans_timers[chan]->CR1 &= ~TIM_CR1_CEN;

			samp_chans_timers[chan]->PSC = reg_dump_read_byte();
			samp_chans_timers[chan]->ARR = reg_dump_read_two_bytes();

			if(samp_chans_timers[chan]->CNT >= samp_chans_timers[chan]->ARR)
			{
				samp_chans_timers[chan]->CNT = samp_chans_timers[chan]->ARR - 3;
			}

