LTVA1/STM32CrapSynth/STM32CrapSynthFirmware/src/playback.c
			samp_chans_timers[chan]->CR1 |= TIM_CR1_CEN;
			break;
		}
		case CMD_DAC_ZERO_CROSS_ENABLE:
		{
			ZCEN_DAC_ENABLE
			break;
		}
		case CMD_DAC_ZERO_CROSS_DISABLE:
		{
			ZCEN_DAC_DISABLE
			break;
		}
		case CMD_DAC_LOOP_POINT_FLASH:
		{
			ss->in_ram = 0;
			ss->loop_point = reg_dump_read_three_bytes();
			break;
		}
		case CMD_DAC_LOOP_POINT_RAM:
		{
			ss->in_ram = 1;
			ss->loop_point = reg_dump_read_two_bytes();
			break;
		}
		case CMD_DAC_LENGTH_FLASH:
		{
			ss->in_ram = 0;
			ss->length = reg_dump_read_three_bytes();
			break;
		}
		case CMD_DAC_LENGTH_RAM:
		{
			ss->in_ram = 1;
			ss->length = reg_dump_read_two_bytes();
			break;
		}
		case CMD_DAC_WAVE_TYPE:
		{
			ss->wave_type = reg_dump_read_byte();

			if(ss->wave_type > 5 || ss->wave_type == 1)
			{
				ss->wavetable = 1;
			}
			else
			{
				ss->wavetable = 0;
			}

			if(chan < 2)
			{
				DAC->CR &= (chan ? (~(DAC_CR_EN2 | DAC_CR_TEN2)) : (~(DAC_CR_EN1 | DAC_CR_TEN1)));

				if(ss->wave_type == 2 || ss->wave_type == 4)
				{
					DAC->CR &= (chan ? (~(DAC_CR_DMAEN2 | DAC_CR_TEN2)) : (~(DAC_CR_DMAEN1 | DAC_CR_TEN1))); //disable DMA request to turn off wave/sample playback
					samp_chans_dma[chan]->CCR &= ~DMA_CCR_EN;
				}
				else
				{
					DAC->CR |= (chan ? (DAC_CR_DMAEN2 | DAC_CR_TEN2) : (DAC_CR_DMAEN1 | DAC_CR_TEN1)); //enable DMA request to turn on wave/sample playback
					samp_chans_dma[chan]->CCR |= DMA_CCR_EN;
				}

				if(ss->wave_type == 0)
				{
					DAC->CR &= (chan ? (~DAC_CR_WAVE2) : (~DAC_CR_WAVE1)); //disable tri or noise
					DAC->CR &= (chan ? (~(DAC_CR_DMAEN2 | DAC_CR_TEN2)) : (~(DAC_CR_DMAEN1 | DAC_CR_TEN1))); //disable DMA request to turn off wave/sample playback
					samp_chans_dma[chan]->CCR &= ~DMA_CCR_EN;
				}
				if(ss->wave_type == 1)
				{
					DAC->CR &= (chan ? (~DAC_CR_WAVE2) : (~DAC_CR_WAVE1)); //disable tri or noise
				}
				if(ss->wave_type == 2 || ss->wave_type == 3)
				{
					DAC->CR &= (chan ? (~DAC_CR_WAVE2) : (~DAC_CR_WAVE1)); //triangle
					DAC->CR |= (chan ? (DAC_CR_WAVE2_1) : (DAC_CR_WAVE1_1));
				}
				if(ss->wave_type == 4 || ss->wave_type == 5)
				{
					DAC->CR &= (chan ? (~DAC_CR_WAVE2) : (~DAC_CR_WAVE1)); //noise
					DAC->CR |= (chan ? (DAC_CR_WAVE2_0) : (DAC_CR_WAVE1_0));
				}

				DAC->CR |= (chan ? (DAC_CR_EN2 | DAC_CR_TEN2) : (DAC_CR_EN1 | DAC_CR_TEN1));
			}

			if(ss->wave_type == 6 && ss->wavetable)
			{
				for(int i = 0; i < WAVETABLE_SIZE; i++)
				{
					wavetable_array[chan][i] = i < ss->duty ? 255 : 0;
				}
			}
			if(ss->wave_type == 7 && ss->wavetable)
			{
				for(int i = 0; i < WAVETABLE_SIZE; i++)
				{
					wavetable_array[chan][i] = i;
				}
			}
			break;
		}
		case CMD_DAC_DUTY:
		{
			//ZCEN_2_ENABLE
			ss->duty = reg_dump_read_byte();

			if(ss->wave_type == 6 && ss->wavetable)
			{
				for(int i = 0; i < WAVETABLE_SIZE; i++)
				{
					wavetable_array[chan][i] = ((i < ss->duty) ? 255 : 0);
				}
			}
			//ZCEN_2_DISABLE
			break;
		}
		case CMD_DAC_WAVETABLE_DATA:
		{
			wave_copy_chans_dma[chan]->CCR &= ~DMA_CCR_EN;
			wave_copy_chans_dma[chan]->CMAR = (uint32_t)&spi_rx_double_buf[curr_read_buf_pos];
			wave_copy_chans_dma[chan]->CNDTR = WAVETABLE_SIZE;
			wave_copy_chans_dma[chan]->CCR |= DMA_CCR_EN;
			curr_read_buf_pos += 256;

			if(curr_read_buf_pos >= EXT_FLASH_RX_BUF_SIZE / 2 && curr_read_buf_pos - 256 < EXT_FLASH_RX_BUF_SIZE / 2)
			{
				read_reg_dump(0, 0);
			}
			/*for(int i = 0; i < WAVETABLE_SIZE; i++)
			{
				wavetable_array[chan][i] = reg_dump_read_byte();
			}*/
			break;
		}
		case CMD_DAC_NOISE_TRI_AMP:
		{
			if(chan < 2)
			{
				DAC->CR &= (chan ? (~(DAC_CR_EN2 | DAC_CR_TEN2)) : (~(DAC_CR_EN1 | DAC_CR_TEN1)));

				DAC->CR &= (chan ? (~DAC_CR_MAMP2) : (~DAC_CR_MAMP1));
				DAC->CR |= (chan ? ((uint32_t)(reg_dump_read_byte() % 12) << 24) : ((uint32_t)(reg_dump_read_byte() % 12) << 8));

				DAC->CR |= (chan ? (DAC_CR_EN2 | DAC_CR_TEN2) : (DAC_CR_EN1 | DAC_CR_TEN1));
			}
			break;
		}
		default: break;
	}
}

__attribute__((section (".ccmram")))
void execute_phase_reset_timer_command(uint8_t channel, uint8_t command)
{
	Timer_state* timer = &state_ram.timer[channel];

	switch(command)
	{
		case CMD_TIMER_CHANNEL_BITMASK:
		{
			timer->chan_bitmask = reg_dump_read_byte();
			break;
		}
		case CMD_TIMER_FREQ:
		{
			if(channel == 0)
			{
				TIM20->CR1 &= ~TIM_CR1_CEN;

				TIM20->PSC = reg_dump_read_byte();
				TIM20->ARR = reg_dump_read_two_bytes();

				if(TIM20->CNT >= TIM20->ARR)
				{
					TIM20->CNT = TIM20->ARR - 3;
				}

				TIM20->CR1 |= TIM_CR1_CEN;
			}
			break;
		}
		case CMD_TIMER_RESET:
		{
			if(channel == 0)
			{
				TIM20->CR1 &= ~TIM_CR1_CEN;

				TIM20->CNT = 0;

				TIM20->CR1 |= TIM_CR1_CEN;
			}

			if(channel == 1)
			{
				SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;
				SysTick->VAL = SysTick->LOAD;
				SysTick->CTRL |= SysTick_CTRL_ENABLE_Msk;
			}

			if(channel > 1 && channel < 6) //UARTs
			{
				//NVIC_DisableIRQ(phase_reset_interrupts[channel]);
				phase_reset_uarts[channel - 2]->CR1 &= ~(USART_CR1_TE | USART_CR1_UE);
				phase_reset_uarts[channel - 2]->CR1 |= (USART_CR1_TE | USART_CR1_UE);
				//phase_reset_uarts[channel - 2]->TDR = 0;
				//NVIC_EnableIRQ(phase_reset_interrupts[channel]);
			}
			break;
		}
		case CMD_TIMER_ENABLE:
		{
			if(channel == 0)
			{
				TIM20->CR1 |= TIM_CR1_CEN;
			}

			if(channel == 1)
			{
				SysTick->CTRL |= SysTick_CTRL_ENABLE_Msk;
			}

			if(channel > 1 && channel < 6) //UARTs
			{
				//NVIC_DisableIRQ(phase_reset_interrupts[channel]);
				phase_reset_uarts[channel - 2]->CR1 |= (USART_CR1_TE | USART_CR1_UE);
				NVIC_EnableIRQ(phase_reset_interrupts[channel]);
				//phase_reset_uarts[channel - 2]->TDR = 0;
			}
			break;
		}
		case CMD_TIMER_DISABLE:
		{
			if(channel == 0)
			{
				TIM20->CR1 &= ~TIM_CR1_CEN;
			}

			if(channel == 1)
			{
				SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;
			}

			if(channel > 1 && channel < 6) //UARTs
			{
				NVIC_DisableIRQ(phase_reset_interrupts[channel]);
				phase_reset_uarts[channel - 2]->CR1 &= ~(USART_CR1_TE | USART_CR1_UE);
			}
			break;
		}
		case CMD_TIMER_FREQ_SYSTICK:
		{
			if(channel == 1)
			{
				SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;
				SysTick->LOAD = ((uint32_t)(reg_dump_read_byte() << 16) | (uint32_t)(reg_dump_read_byte() << 8) | (uint32_t)reg_dump_read_byte());

				if(SysTick->VAL > SysTick->LOAD) SysTick->VAL = SysTick->LOAD;

				SysTick->CTRL |= SysTick_CTRL_ENABLE_Msk;
			}
			break;
		}
		case CMD_TIMER_FREQ_UART:
		{
			if(channel > 1 && channel < 6) //UARTs
			{
				//NVIC_DisableIRQ(phase_reset_interrupts[channel]);
				//phase_reset_uarts[channel - 2]->CR1 &= ~(USART_CR1_TE | USART_CR1_UE);
				phase_reset_uarts[channel - 2]->BRR = reg_dump_read_two_bytes();
				//phase_reset_uarts[channel - 2]->CR1 |= (USART_CR1_TE | USART_CR1_UE);
				//phase_reset_uarts[channel - 2]->TDR = 0;
				//NVIC_EnableIRQ(phase_reset_interrupts[channel]);
			}
			break;
		}

