LTVA1/STM32CrapSynth/STM32CrapSynthFirmware/src/playback.c
		default: break;
	}
}

__attribute__((section (".ccmram")))
void execute_commands()
{
	if(!new_tick) return;

	while(1)
	{
		curr_command = reg_dump_read_byte();
		curr_chan = 0xff;

		if(curr_command == CMD_NOP)
		{
			while(curr_command == CMD_NOP)
			{
				curr_command = reg_dump_read_byte();
			}
		}

		if(curr_command != CMD_NEXT_FRAME)
		{
			for(int i = 0; i < 14; i++)
			{
				if(curr_command >= chan_base_addr[i] && curr_command < chan_base_addr[i + 1])
				{
					curr_chan = i;
					break;
				}
			}

			switch(curr_chan)
			{
				case 0:
				case 1:
				case 2:
				case 3:
				{
					execute_dds_pwm_command(curr_chan, curr_command - chan_base_addr[curr_chan]);
					break;
				}
				case 4:
				{
					execute_noise_command(curr_command - chan_base_addr[curr_chan]);
					break;
				}
				case 5:
				case 6:
				case 7:
				{
					execute_dac_command(curr_chan - 5, curr_command - chan_base_addr[curr_chan]);
					break;
				}
				case 8:
				case 9:
				case 10:
				case 11:
				case 12:
				case 13:
				{
					execute_phase_reset_timer_command(curr_chan - 8, curr_command - chan_base_addr[curr_chan]);
					break;
				}
				default: break;
			}
		}

		if(curr_command == CMD_NEXT_FRAME) break;

		if(curr_command == CMD_SET_RATE)
		{
			set_playback_rate();
		}

		if(curr_command == CMD_END)
		{
			stop_playback();
		}

		if(curr_command == CMD_LOOP_POINT)
		{
			curr_buf_pos = 0;
			curr_dump_pos = reg_dump_read_four_bytes();
			uint32_t temp = curr_dump_pos;

			CS_EXT_FLASH_HIGH
			curr_read_buf_pos = 0;

			read_reg_dump(0, 1);
			read_reg_dump(1, 0);

			curr_dump_pos = temp;

			if(curr_dump_pos == 0)
			{
				TIM2->ARR = reg_dump_read_four_bytes();
				TIM2->PSC = 0;

				uint8_t dummy = reg_dump_read_byte(); //skip next frame command
				(void)dummy;
			}
		}
	}

	new_tick = 0;

	if(att_need_write)
	{
		att_flush();
	}
}





































void test_play_wavetable()
{
	for(int i = 0; i < WAVETABLE_SIZE; i++)
	{
		wavetable_array[0][i] = i;
	}

	//wavetable_array[0][200] = 0xff;

	for(int i = 0; i < WAVETABLE_SIZE; i++)
	{
		wavetable_array[1][i] = (i > 127) ? ~(i * 2) : (i * 2);
	}

	//wavetable_array[1][210] = 0xff;

	TIM6->ARR = 601;
	TIM6->PSC = 0;

	TIM7->ARR = 600;
	TIM7->PSC = 0;

	TIM16->ARR = 500;
	TIM16->PSC = 0;

	/*NVIC_DisableIRQ(DMA2_Channel3_IRQn);

	DMA2_Channel3->CMAR = (uint32_t)&wavetable_array[0][0];
	DMA2_Channel3->CNDTR = WAVETABLE_SIZE;
	DMA2_Channel3->CCR |= DMA_CCR_CIRC;

	DMA2_Channel3->CCR |= DMA_CCR_EN;

	NVIC_DisableIRQ(DMA2_Channel4_IRQn);

	DMA2_Channel4->CMAR = (uint32_t)&wavetable_array[1][0];
	DMA2_Channel4->CNDTR = WAVETABLE_SIZE;
	DMA2_Channel4->CCR |= DMA_CCR_CIRC;

	DMA2_Channel4->CCR |= DMA_CCR_EN;*/

	DMA1_Channel6->CMAR = (uint32_t)&wavetable_array[1][0];
	DMA1_Channel6->CNDTR = WAVETABLE_SIZE;
	DMA1_Channel6->CCR |= DMA_CCR_CIRC;

	DMA1_Channel6->CCR |= DMA_CCR_EN;

	NVIC_DisableIRQ(DMA1_Channel6_IRQn);

	//TIM6->CR1 = TIM_CR1_CEN;
	//TIM7->CR1 = TIM_CR1_CEN;

	TIM1->ARR = 255;
	TIM16->CR1 |= TIM_CR1_CEN;
}

void test_play_sample()
{
	TIM6->ARR = 1580;
	TIM6->PSC = 0;

	NVIC_EnableIRQ(DMA2_Channel3_IRQn);

	DMA2_Channel3->CMAR = BASE_ADDR_FLASH;
	DMA2_Channel3->CNDTR = 0xffff;
	state_ram.dac[0].curr_portion_size = 0xffff;
	DMA2_Channel3->CCR |= DMA_CCR_CIRC;

	state_ram.dac[0].start_offset = 0;
	state_ram.dac[0].length = 130897;
	state_ram.dac[0].loop = 1;
	state_ram.dac[0].loop_point = 50000;
	state_ram.dac[0].prescaler = 0;
	state_ram.dac[0].volume = 0xff;
	state_ram.dac[0].wavetable = 0;
	state_ram.dac[0].curr_pos = 0;

	DMA2_Channel3->CCR |= DMA_CCR_EN;

	TIM6->CR1 = TIM_CR1_CEN;
}
